DiplomD/src/Reports/УспеваемостьГруппПоДисцилинам/УспеваемостьГруппПоДисцилинам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>УспеваемостьГруппПоДисцилинам</name>
  <attributes>
    <name>НаправлениеПодготовки</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодНачалаОбучения</name>
    <type>
      <types>EnumRef.ГодНачалаОбучения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтроля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидАттестации</name>
      <type>
        <types>EnumRef.ВидыромежуточнойАттестации</types>
        <types>EnumRef.АттестационныеМероприятия</types>
        <types>EnumRef.ФормыТекущегоКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОценок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоАкадемическихЗадолженностей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

DiplomD/src/Documents/ТекущийКонтроль/ТекущийКонтроль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТекущийКонтроль</name>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.РабочаяПрограммаДисцилины</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтроля</name>
    <type>
      <types>EnumRef.ФормыТекущегоКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ФормированиеУчебныхГрупп</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведенКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСтудентов</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтуденческогоБилета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>EnumRef.ФормаОценки</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Documents/ПромежуточнаяАттестация/ПромежуточнаяАттестация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПромежуточнаяАттестация</name>
  <registerRecords>AccumulationRegister.РейтингСтудентов</registerRecords>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.РабочаяПрограммаДисцилины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДисциплины</name>
    <type>
      <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАттестации</name>
    <type>
      <types>EnumRef.ВидыромежуточнойАттестации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗачетнойКнижки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БаллПромежуточнойАттестации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Catalogs/Группы/Группы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Группы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кафедра</name>
    <type>
      <types>CatalogRef.Кафедры</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразовательнаяПрограмма</name>
    <type>
      <types>CatalogRef.ОбразовательныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбразования</name>
    <type>
      <types>CatalogRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодНачалаОбучения</name>
    <type>
      <types>EnumRef.ГодНачалаОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Reports/УспеваемостьГруппПоДисцилинам/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
		
	//ПОИСК текущего контроля 
	
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	|	Группы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Группы КАК Группы
	|ГДЕ
	|	Группы.ПрофильНаправления = &ПрофильНаправления
	|	И Группы.ФормаОбучения = &ФормаОбучения
	|	И Группы.ГодНачалаОбучения = &ГодНачалаОбучения";
	Запрос.УстановитьПараметр("ПрофильНаправления",Отчет.направлениеПодготовки); 
	Запрос.УстановитьПараметр("ФормаОбучения",Отчет.ФормаОбучения);
	Запрос.УстановитьПараметр("ГодНачалаОбучения",Отчет.ГодНачалаОбучения); 
	рез = Запрос.Выполнить().Выгрузить(); 
	Для каждого стр из Рез Цикл 
		ЗапросТекКонтр = Новый запрос; 
		ЗапросТекКонтр.Текст = "ВЫБРАТЬ
		                       |	ТекущийКонтроль.Дисциплина КАК Дисциплина,
		                       |	ТекущийКонтроль.ВидКонтроля КАК ВидКонтроля,
		                       |	ТекущийКонтроль.Ссылка КАК Ссылка,
		                       |	ТекущийКонтроль.Номер КАК Номер
		                       |ИЗ
		                       |	Документ.ТекущийКонтроль КАК ТекущийКонтроль
		                       |ГДЕ
		                       |	ТекущийКонтроль.Группа = &Группа
		                       |	И ТекущийКонтроль.Семестр = &Семестр"; 
		ЗапросТекКонтр.УстановитьПараметр("Группа",Стр.Ссылка); 
		ЗапросТекКонтр.УстановитьПараметр("Семестр",Отчет.Семестр); 
		Р = ЗапросТекКонтр.Выполнить().Выгрузить(); 
		Для каждого строка из Р Цикл 
			О = Отчет.ТЧ.Добавить(); 
			О.Группа = Стр.Ссылка; 
			О.Дисциплина = Строка.Дисциплина; 
			О.ВидКонтроля = "Текущий контроль"; 
			О.ВидАттестации = Строка.ВидКонтроля;
			ВыставленныеОценки = 0; 
			Долги = 0; 
			ЗапросОценки = Новый Запрос; 
			ЗапросОценки.Текст = "ВЫБРАТЬ
			                     |	ТекущийКонтрольСписокСтудентов.Оценка КАК Оценка
			                     |ИЗ
			                     |	Документ.ТекущийКонтроль.СписокСтудентов КАК ТекущийКонтрольСписокСтудентов
			                     |ГДЕ
			                     |	ТекущийКонтрольСписокСтудентов.Ссылка.Номер = &Номер";
			
			 ЗапросОценки.УстановитьПараметр("Номер",Строка.Номер); 
			 Ррр = ЗапросОценки.Выполнить().Выгрузить(); 
			 Для каждого Нстр из Ррр Цикл
				 Если Не ПустаяСтрока(НСтр.Оценка) Тогда 
					ВыставленныеОценки = ВыставленныеОценки +1; 
				Иначе 
					Долги = Долги +1; 
				КонецЕсли; 
				
				 
			КонецЦикла; 
			О.КоличествоОценок =  ВыставленныеОценки; 
			О.КоличествоАкадемическихЗадолженностей = Долги; 
			 
		КонецЦикла; 
		
		
	КонецЦикла;
	
	//ПОИСК промежуточной аттестации
	
	ЗапросПромАтт = Новый Запрос; 
	ЗапросПромАтт.Текст = "ВЫБРАТЬ
	                      |	ПромежуточнаяАттестация.Номер КАК Номер,
	                      |	ПромежуточнаяАттестация.Дисциплина КАК Дисциплина,
	                      |	ПромежуточнаяАттестация.ВидАттестации КАК ВидАттестации,
	                      |	ПромежуточнаяАттестация.Группа КАК Группа
	                      |ИЗ
	                      |	Документ.ПромежуточнаяАттестация КАК ПромежуточнаяАттестация
	                      |ГДЕ
	                      |	ПромежуточнаяАттестация.ПрофильНаправления = &ПрофильНаправления
	                      |	И ПромежуточнаяАттестация.ФормаОбучения = &ФормаОбучения
	                      |	И ПромежуточнаяАттестация.Семестр = &Семестр"; 
	
	 ЗапросПромАтт.УстановитьПараметр("ПрофильНаправления",Отчет.направлениеПодготовки); 
	 ЗапросПромАтт.УстановитьПараметр("ФормаОбучения",Отчет.ФормаОбучения); 
	 ЗапросПромАтт.УстановитьПараметр("Семестр",Отчет.Семестр); 
	 результатПоиска = ЗапросПромАтт.Выполнить().Выгрузить(); 
	 
	 КолОценокПромежАтт = 0; 
	 КолДолгов = 0; 
	 
	 Для каждого Нстрока из результатПоиска Цикл
		 ЗапросРезультатыПА = Новый Запрос; 
		 ЗапросРезультатыПА.Текст = "ВЫБРАТЬ
		                            |	ПромежуточнаяАттестацияТЧ.БаллПромежуточнойАттестации КАК БаллПромежуточнойАттестации
		                            |ИЗ
		                            |	Документ.ПромежуточнаяАттестация.ТЧ КАК ПромежуточнаяАттестацияТЧ
		                            |ГДЕ
		                            |	ПромежуточнаяАттестацияТЧ.Ссылка.Номер = &Номер";
		    ЗапросРезультатыПА.УстановитьПараметр("Номер",Нстрока.Номер); 
			результатРезультатов = ЗапросРезультатыПА.Выполнить().Выгрузить(); 
			Для каждого Р из результатРезультатов Цикл 
				Если ПустаяСтрока(Р.БаллПромежуточнойАттестации) Тогда 
				 КолДолгов = КолДолгов + 1; 
			 Иначе 
				КолОценокПромежАтт = КолОценокПромежАтт +1; 
			КонецЕсли; 
			
				
		КонецЦикла;
		О = Отчет.ТЧ.Добавить(); 
		о.Группа = Нстрока.группа; 
		О.Дисциплина = Нстрока.Дисциплина; 
		О.ВидКонтроля = "Промежуточная аттестация"; 
		О.ВидАттестации = Нстрока.ВидАттестации; 
		О.КоличествоОценок =КолОценокПромежАтт; 
		О.КоличествоАкадемическихЗадолженностей = КолДолгов; 
			
	КонецЦикла;   
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПЕЧАТЬНаСервере() 
	ТабДок = Новый ТабличныйДокумент; 
	
	Макет = Отчеты.УспеваемостьГруппПоДисцилинам.ПолучитьМакет("Макет"); 
	
	Шапка = Макет.ПолучитьОбласть("Шапка"); 
	
	Шапка.Параметры.Сем = отчет.Семестр; 
	Табдок.Вывести(Шапка); 
	
	Шапкатабл = Макет.ПолучитьОбласть("ШапкаТабл"); 
	ТабДок.Вывести(Шапкатабл); 
	
	Табл = макет.ПолучитьОбласть("табл"); 
	
	Для каждого стр из Отчет.ТЧ Цикл 
		Табл.Параметры.Груп = Стр.Группа; 
		Табл.Параметры.Дисц = Стр.Дисциплина; 
		Табл.Параметры.Форма = Стр.ВидКонтроля; 
		Табл.Параметры.Вид = Стр.ВидАттестации; 
		Табл.Параметры.Выст = Стр.КоличествоОценок; 
		табл.Параметры.Академ = Стр.КоличествоАкадемическихЗадолженностей; 
		
		табдок.Вывести(Табл); 
		
		
	КонецЦикла;
	
	Возврат ТабДок; 
	
	
	// Вставить содержимое обработчика.
КонецФункции


&НаКлиенте
Процедура ПЕЧАТЬ(Команда)
	ТабДок = Новый ТабличныйДокумент; 
	Табдок = ПЕЧАТЬНаСервере(); 
	ТабДок.Показать();
КонецПроцедуры
